app/Http/Controllers/Blog/BlogController.php

    public function __construct()
    {
        /**
         * share categories
         */
        View::share('categories', Category::where('status', 1)->get());
        /**
         * share tags
         */
        View::share('tags', Tag::where('status', 1)->get());
---
select * from `categories` where `status` = '1'
select * from `tags` where `status` = '1'

    public function index(){
    	/**
    	 * get post status = 1
    	 * join category _id
    	 * @var [type]
    	 */
    	$posts 	= Post::where('posts.status','=', 1)
    			->join('categories', 'category_id', '=', 'categories.id')
    			->join('users', 'user_id', '=', 'users.id')
    			->select('posts.*', 'categories.name as category_name', 'categories.slug as category_slug', 'users.name as author')
    			->paginate(15);
---
select `posts`.*, `categories`.`name` as `category_name`, `categories`.`slug` as `category_slug`, `users`.`name` as `author` from `posts` inner join `categories` on `category_id` = `categories`.`id` inner join `users` on `user_id` = `users`.`id` where `posts`.`status` = '1' limit 15 offset 0
select count(*) as aggregate from `posts` inner join `categories` on `category_id` = `categories`.`id` inner join `users` on `user_id` = `users`.`id` where `posts`.`status` = '1'

    public function showResultSearch(Request $request){
        $tuKhoa =  $request->Input('q');

        if($tuKhoa != ""){
            $posts = Post::where('status', 1)
                        ->where(function($query) use ($tuKhoa) {
                            return $query->where('title', 'like', "%$tuKhoa%")
                                        ->orWhere('description', 'like', "%$tuKhoa%");
                        })
                        ->take(30)
                        ->paginate(5);
---
select * from `posts` where `status` = '1' and (`title` like '%vero%' or `description` like '%vero%') limit 5 offset 0
select count(*) as aggregate from `posts` where `status` = '1' and (`title` like '%vero%' or `description` like '%vero%')

    public function showDetailCategory($id, $slug){
        $category = Category::where(
                    'id', '=', $id,
                    'and',
                    'status', '=', 1
                    )
                    ->with(['posts' => function($queryPosts){
                        $queryPosts->with(['author' => function($queryAuthor){
                            $queryAuthor->select('id','name');
                        }]);
                    }])
                    ->get()
                    ->first();
---
select * from `posts` where `posts`.`category_id` in ('4')

    public function showDetailAuthor($id){
        $user = User::find($id)->first();
---
select * from `users` where `users`.`id` = '5' limit 1