app/Http/Controllers/AdminController.php

    public function index(){
        $countPosts = Post::where('status', 1)->count();
---
select count(*) as aggregate from `posts` where `status` = '1'