app/Http/Controllers/Admin/AdminPostController.php

    public function datatablesPosts(){
    	$posts = Post::where('status', 1)->get();
---
select * from `posts` where `status` = '1'

    public function getAdd(Request $request){
      $categories = Category::where('status', 1)->get();
---
select * from `categories` where `status` = '1'